using System.Collections;
using System.Collections.Generic;
using UnityEngine;
using UnityEngine.UI;
using UnityEngine.SceneManagement;
using TMPro;
using UnityEditor.VersionControl;
using UnityEditor;
public class Quizer : MonoBehaviour
{
    // Start is called before the first frame update
    public Button Yes;
    public Button No;
    public TextMeshProUGUI question;
    public Image Main1;
    public List<Sprite> sprites1 = new List<Sprite>();
    public List<Sprite> sprites2 = new List<Sprite>();
    private List<string> questions = new List<string>()
    {
        "1 лютого 1958 року за Всесвітнім координованим часом (UTC) США запустили супутник Explorer 1, який став першим штучним супутником Землі.",
        "80 відсотків хвороб в усьому світі пов’язані із забрудненою водою.",
        "Ігор Сікорський першим висунув ідею транспортного засобу з повітряним  гвинтом і став винахідником гелікоптера.",
        "Завдяки цьому сайту Марк Цукерберг в 23 роки став наймолодшим мільярдером планети.",
        "У відомого хіміка Д.І. Менделєєва хімії присвячено всього 10% наукових робіт.",
        "У ві сні  Д.І. Менделєєва побачив зовсім не таблицю елементів. Йому наснилося,  що він шпигун який викрадає у китайського імператора формулу пороха.",
        "Хочете вірте, а хочете ні, але перший дрон зробив Тесла.",
        "Свою знамениту періодичну систему хімічних елементів Дмитро Іванович Менделєєв побачив уві сні.",
        "Тесла побудував електричний підводний човен, що харчувався від електроенергії.  Енергію човен отримував за допомогою приймача і акумулював у батареях.",
        "Першим винаходом Едісона була зовсім на лампа розжарювання."
    };
    private List<string> answers = new List<string>()
    {
        "Ні!",
        "Так!",
        "Ні!",
        "Так!",
        "Так!",
        "Ні!",
        "Так!",
        "Ні!",
        "Ні!",
        "Ні!"
    };
    private List<string> facts = new List<string>()
    {
    "Ні. Першим штучним супутником став «Супутник-1», запущений 4 жовтня 1957 року Радянським Союзом. Найвагомішим досягненням Explorer 1 було відкриття радіаційних поясів Землі, які тепер відомі як пояси Ван Аллена. " +
    "Ці радіаційні зони складаються з заряджених частинок, захоплених магнітним полем Землі, і є критично важливими для розуміння космічного середовища, яке оточує нашу планету.",

    "Так. Наслідки забруднення можна назвати небезпечними і всеосяжними. Ось деякі з них:\r\n" +
    "1) Руйнування емалі зубів через надлишок фтору.\r\n" +
    "2) Спалахи гепатитів, спровоковані бактеріями і кишковою паличкою.\r\n" +
    "3) Перевантаження організму залізом, що викликає порушення формування кісткової тканини.\r\n" +
    "4) Накопичення свинцю, хрому, кадмію, бензапирену, а також хлору у воді провокує появу онкологічних та нервових розладів.\r\n" +
    "5) Інфекційні та кишкові захворювання: від тифу і дизентерії до холери.\r\n" +
    "6) Погіршення стану волосся і шкіри.\r\n" +
    "7) З'єднання фенолу і фтору негативно впливають на роботу нирок і печінки.\r\n" +
    "8) Зараження організму паразитами через воду.\r\n" +
    "9) Радіоактивні ізотопи і пестициди накопичуються в організмі та циркулюють у харчових ланцюгах, руйнуючи тканини і призводячи до безпліддя та генетичних мутацій.",

    "Ні. Ідея повітряного гвинта належить славетному Леонардо да Вінчі (XV століття). Ігор Сікорський створив першу діючу модель за одногвинтовою схемою із хвостовим рульовим гвинтом, яка зрештою стала панівною.",

    "Так. Facebook — найбільша соціальна мережа, що почала працювати як мережа для студентів деяких американських університетів. Facebook належить корпорації Meta Platforms. " +
    "Засновником та головою сервісу є Марк Цукерберг. Сайт facebook.com посідає 7 місце за відвідуваністю у світі. Станом на березень 2023 року зафіксовано 2,94 млрд користувачів. " +
    "У квітні 2016 року ринкова капіталізація Facebook сягнула 319 млрд доларів. З 4 січня 2022 року компанія Facebook називається Meta.",

    "Так. Відомо, що Менделєєв захоплювався проектами літальних апаратів. У 1887 році він піднявся на повітряній кулі власної конструкції на висоту понад 3000 метрів. " +
    "Там йому вдалося виміряти тиск і температуру, і навіть побачити сонячне затемнення. За цей політ Менделєєв був нагороджений медаллю ФААМ (Французької академії аеростатичних метеорологій).",
    "Ні. Такого не було, але у 1892 році Менделєєв створив рецепт бездимного пороху, та запатентувати його не встигли. У 1914 році Росія купувала у США бездимний порох, придуманий ученим.",
    "Так. Дрон Тесли - один з перших прототипів радіокерованого човна (і взагалі телемеханіки), створений Миколою Теслой і вперше показаний ним публіці в 1898 на електричній виставці в Медісон-сквер-гарден.",
    "Ні. Всупереч цьому поширеному міфу, свою знамениту періодичну таблицю вчений придумав через роки напруженої праці, а не побачив її уві сні. Навіть сам вчений віджартовувався - 'Я може над нею років 20 думав, а ви думаєте, що так просто сів і придумав' ",
    "Ні. У 1898 році Тесла отримав патент на автоматичний човен, який приводився в дію електрикою. Але побудова такого човна не відбулась.Хоча Тесла експериментував із такими технологіями, практична передача енергії на значні відстані залишається складною задачею",
    "Ні. Першим винаходом Едісона був фонограф – пристрій для механічного запису і відтворення звуків. Його запросили продемонструвати це президенту США – Резерфорду Б. Хейсу – в Білому домі."
    };
    private int num;
    public GameObject panel;
    public TextMeshProUGUI message;
    public TextMeshProUGUI fact;
    public Image Main2;
    public Button menu;
    void Start()
    {
        Generate();
    }
    public void Generate()
    {
        num = CountDay1.LoadInter1();
        Main1.sprite = sprites1[num];
        question.text = questions[num];
        Yes.onClick.AddListener(Check1);
        No.onClick.AddListener(Check2);
    }
    private void Check1()
    {
        if (answers[num] == "Так!")
        {
            Correct();
        }
        else
        {
            NotCorrect();
        }
    }
    private void Check2()
    {
        if (answers[num] == "Ні!")
        {
            Correct();
        }
        else
        {
            NotCorrect();
        }
    }
    private void Correct()
    {
        panel.gameObject.SetActive(true);
        message.text = "Правильно!";
        message.color = new Color(53f / 255f, 255f / 255f, 0f / 255f);
        Main2.sprite = sprites2[num];
        fact.text = facts[num];
        menu.onClick.RemoveAllListeners();
        menu.onClick.AddListener(Back);
        PlayerPrefs.SetString("DAY1", System.DateTime.Now.ToString("o"));
        PlayerPrefs.Save();
    }
    private void NotCorrect()
    {
        panel.gameObject.SetActive(true);
        message.text = "Не правильно!";
        message.color = new Color(255f / 255f, 59f / 255f, 0f / 255f);
        Main2.sprite = sprites2[num];
        fact.text = facts[num];
        menu.onClick.RemoveAllListeners();
        menu.onClick.AddListener(Back);
        PlayerPrefs.SetString("DAY1", System.DateTime.Now.ToString("o"));
        PlayerPrefs.Save();
    }
    private void Back()
    {
        SceneManager.LoadScene("Quiz");
    }
}
